# 每个法律结构构建一套结构名称和结构对应结构内schema的dict
# 结构：{
#     "name": "结构名称",
#     "description": "结构描述"
# }
# schema：{
#     "nodes": "节点",
#     "edges": "边",
#     "structure_prompt": "结构内提示词"
# }
# 每个类别的诉讼文书对应一组结构（list[dict]），多个结构组成一份诉讼文书架构
# 根据类别，分块提示词获取列表中的结构；块内提示词使用对应结构的schema和提示词
# 除诉讼基本信息由文书首部、诉讼参与者信息、审判组织及日期组成诉讼基础信息外，其余部分基本一种结构对应一种schema

# # 默认诉讼结构
# default_head = {
#     "name": "文书首部",
#     "description": "包含文书类型、法院名称、案号等最基础的文书标识信息。"
# }
#
# default_participant = {
#     "name": "诉讼参与者信息",
#     "description": "详细列明本案所有参与诉讼的机关和个人身份信息，包括公诉机关、原告、被告、第三人等的基本信息。"
# }
#
# default_trial_process = {
#     "name": "案件审理过程",
#     "description": "记载本案从起诉到开庭的程序性事项，是案件进入实体审理的过渡段。"
# }
#
# default_defense_claim = {
#     "name": "诉辩主张",
#     "description": "包含“公诉机关、上诉人等指控”的全部内容（事实、证据、法律意见）以及“被告人及辩护人等意见”的全部内容。这是双方诉辩观点的完整呈现。"
# }
#
# default_fact = {
#     "name": "事实认定",
#     "description": "一般以“经审理查明”开头，是法院对案件事实的最终确认，包括事实本身、证据列举和证据认证结论。"
# }
#
# default_court_reasoned = {
#     "name": "法院评议",
#     "description": "一般以“本院认为”开头，是法院对案件性质、法律适用、争议焦点进行分析论证的部分，不包含事实描述。"
# }
#
# default_judgment = {
#     "name": "裁判主文",
#     "description": "一般以“依照XX(法规)...，判决如下：”或“裁定如下：”开头，是法院作出的最终、具体的处理决定。要包含法院裁判的完整内容。"
# }
#
# default_right_to_appeal = {
#     "name": "上诉权利告知",
#     "description": "一般以“如不服本判决，可在判决书送达之日起十五日内，向本院递交上诉状，并按对方当事人的人数提出副本，上诉于[上诉法院名称]。”开头，固定格式文本，告知当事人不服判决时的上诉权利、期限和法院。"
# }
#
# default_organization_and_date_of_trial = {
#     "name": "审判组织及日期",
#     "description": "列明参与案件审判的审判人员、辅助人员姓名及判决作出的日期，如“审判员：[审判员姓名]，书记员：[书记员姓名]，[日期]”等。"
# }
#
# default_appendix_french = {
#     "name": "附录法文",
#     "description": "附录法文是附在审判组织及日期之后的内容，补充列明判决所依据的主要法律条文的具体内容，是可选结构。\n注意：附录法文一定在审判组织及日期之后。"
# }
# # 默认结构schema
# default_litigation_basic_info_schema = {
#     "chunks": [
#         default_head.get("name"),
#         default_participant.get("name"),
#         default_organization_and_date_of_trial.get("name"),
#         default_trial_process.get("name")
#     ],
#     "nodes": """
# ## 诉讼
# ### 描述
# 表示判决文书记录的一场法律纠纷的全过程，是法律程序实例
# ### 属性
# - 诉讼名称: 诉讼案件名称
# - 审级: 案件的审理级别，如"一审", "二审", "再审",
# - 案号: 案件编号，如"(2021)粤03民初6066号",
# - 案由: 法律术语，描述案件的性质或争议类型,
# - 案件类型: 诉讼案件的类别，如"民事", "行政", "刑事",
# - 上诉日期: 指上级法院收到上诉状并予以立案的日期，仅适用于二审及以上程序。
# - 审理方式: 描述法院采用的主要审理形式。如 开庭审理 / 书面审理 / 询问 / 听证 / 调解,
# - 审理法院: 对该诉讼案件进行审理的法院,
# - 诉讼阶段: 描述本案在整个司法流程中所处的状态。包括 审理中 / 已结案 / 上诉中 / 执行中 / 已归档,
# - 立案日期: 指法院正式受理该案并登记立案的具体日期。
# - 结案日期: 指法院作出最终裁判文书并宣告本案审理终结的日期。
# - 是否公开审理: 表示本案是否依法向社会公众开放庭审过程。
#
# ## 诉讼参与者
# ### 描述
# 表示在诉讼中承担某法律职能或身份的自然人或组织，与诉讼建立直接参与关系，要严格区别于案例主体
# ### 属性
# - 名称: 该人员或组织的真实姓名，通常为实名登记信息。,
# - 性别: 根据上下文推断或直接记载的性别信息。,
# - 民族: 自然人的民族属性,
# - 职业: 自然人的职业，如律师,
# - 出生日期: 自然人的出生日期,
# - 出庭情况: 是否实际到庭参加庭审或询问，影响程序合法性判断。,
# - 参与阶段: 该人员在哪一审判阶段参与了诉讼。,
# - 诉讼角色: 自然人或组织在诉讼案件中的参与身份，包括上诉人、被上诉人、委托诉讼代理人、法定代表人、一审第三人、审判长、审判员、法官助理、书记员等,
# - 所住地/注册地: 自然人的实际所住地或组织注册地址
#     """,
#     "edges": """
# ## 参与
# ### 描述
# 诉讼参与者参与诉讼案件，每个诉讼参与者必定存在该关系
# ### 关系三元组
# - 诉讼参与者-参与-诉讼
#     """,
#     "structure_prompt": """
# # 角色
# 您是一个诉讼文本分析专家，能够从诉讼文本中准确提取实体、属性和关系信息，用于合规案例知识图谱。
# # 任务说明
# 请从给定的诉讼文本提取知识图谱所需的节点和关系，构建合规案例知识图谱。请严格按照下面的节点类型、属性和关系类型进行识别和提取，并以JSON格式输出。
# ⚠️ 注意：
# 1. 给定的文本，其整体是一个诉讼实体，即单次任务中有且只有一个“诉讼”实体。
# 2. 诉讼参与者包含两大类，一类为上半段内诉讼双方，包括原告、被告、第三人等，另一类为下半段内诉讼审判组织，包括审判长、审判员、法官助理、书记员等。
# """,
#     "examples": [
#         {
#             "text": """
# 判决书名称：夏某与某某公司劳动合同纠纷一审民事判决书
# 上海市金山区人民法院
# 民 事 判 决 书
# （2024）沪0116民初16350号
# 原告：夏某，男，1984年2月12日生，汉族，住江苏省无锡市惠山区。
# 委托诉讼代理人：王某1，某某律师事务所1律师。
# 被告：某某公司1，住所地上海市金山工业区。
# 法定代表人：王某2，执行董事。
# 原告夏某与被告某某公司1（以下简称某某公司1）劳动合同纠纷一案，本院于2024年11月7日立案后，依法适用简易程序，于2024年11月19日公开开庭进行了审理。原告夏某及其委托诉讼代理人王某1、被告某某公司1委托诉讼代理人到庭参加诉讼。本案现已审理终结。
# 审 判 员　　王　文
# 二〇二五年一月二十一日
# 书 记 员　　陆园涛
#     """,
#             "nodes": [
#                 {
#                     "name": "夏某与某某公司劳动合同纠纷一审民事判决书",
#                     "type": "诉讼",
#                     "attributes": {
#                         "诉讼名称": "夏某与某某公司劳动合同纠纷一审民事判决书",
#                         "审级": "一审",
#                         "案号": "（2024）沪0116民初16350号",
#                         "案由": "劳动合同纠纷",
#                         "案件类型": "民事",
#                         "审理方式": "开庭审理",
#                         "审理法院": "上海市金山区人民法院",
#                         "诉讼阶段": "已结案",
#                         "立案日期": "2024年11月7日",
#                         "结案日期": "2025年1月21日",
#                         "是否公开审理": "是"
#                     }
#                 },
#                 {
#                     "name": "夏某",
#                     "type": "诉讼参与者",
#                     "attributes": {
#                         "名称": "夏某",
#                         "性别": "男",
#                         "出生日期": "1984年2月12日",
#                         "民族": "汉族",
#                         "所住地": "江苏省无锡市惠山区",
#                         "诉讼角色": "原告",
#                         "参与阶段": "一审",
#                         "出庭情况": "到庭"
#                     }
#                 },
#                 {
#                     "name": "王某1",
#                     "type": "诉讼参与者",
#                     "attributes": {
#                         "名称": "王某1",
#                         "职业": "律师",
#                         "所属机构": "某某律师事务所1",
#                         "诉讼角色": "委托诉讼代理人",
#                         "参与阶段": "一审",
#                         "出庭情况": "到庭"
#                     }
#                 },
#                 {
#                     "name": "某某公司1",
#                     "type": "诉讼参与者",
#                     "attributes": {
#                         "名称": "某某公司1",
#                         "注册地": "上海市金山工业区",
#                         "法定代表人": "王某2",
#                         "诉讼角色": "被告",
#                         "参与阶段": "一审"
#                     }
#                 },
#                 {
#                     "name": "王文",
#                     "type": "诉讼参与者",
#                     "attributes": {
#                         "名称": "王文",
#                         "诉讼角色": "审判员",
#                         "参与阶段": "一审"
#                     }
#                 },
#                 {
#                     "name": "陆园涛",
#                     "type": "诉讼参与者",
#                     "attributes": {
#                         "名称": "陆园涛",
#                         "诉讼角色": "书记员",
#                         "参与阶段": "一审"
#                     }
#                 }
#             ],
#             "edges": [
#                 {
#                     "name": "",
#                     "type": "参与",
#                     "attributes": {
#                         "主体": "诉讼参与者_夏某",
#                         "谓词": "参与",
#                         "客体": "诉讼_夏某与某某公司劳动合同纠纷一审民事判决书"
#                     }
#                 },
#                 {
#                     "name": "",
#                     "type": "参与",
#                     "attributes": {
#                         "主体": "诉讼参与者_王某1",
#                         "谓词": "参与",
#                         "客体": "诉讼_夏某与某某公司劳动合同纠纷一审民事判决书"
#                     }
#                 },
#                 {
#                     "name": "",
#                     "type": "参与",
#                     "attributes": {
#                         "主体": "诉讼参与者_某某公司1",
#                         "谓词": "参与",
#                         "客体": "诉讼_夏某与某某公司劳动合同纠纷一审民事判决书"
#                     }
#                 },
#                 {
#                     "name": "",
#                     "type": "参与",
#                     "attributes": {
#                         "主体": "诉讼参与者_王文",
#                         "谓词": "参与",
#                         "客体": "诉讼_夏某与某某公司劳动合同纠纷一审民事判决书"
#                     }
#                 },
#                 {
#                     "name": "",
#                     "type": "参与",
#                     "attributes": {
#                         "主体": "诉讼参与者_陆园涛",
#                         "谓词": "参与",
#                         "客体": "诉讼_夏某与某某公司劳动合同纠纷一审民事判决书"
#                     }
#                 }
#             ]
#         }
#     ]
# }
#
#
# default_defense_claim_schema = {
#
# }
#
#
# default_case_structure = {
#     "诉讼基础信息": default_litigation_basic_info_schema,
#     "诉讼其他结构": [
#         default_defense_claim_schema
#     ]
# }
#
#
# def default_legal_structure():
#     default_structure_list = [
#         default_head,
#         default_participant,
#         default_trial_process,
#         default_defense_claim,
#         default_fact,
#         default_court_reasoned,
#         default_judgment,
#         default_right_to_appeal,
#         default_organization_and_date_of_trial,
#         default_appendix_french
#     ]
#     structure_description = "一份完整的民事判决书通常包含以下结构部分："
#     structure_list = []
#     for structure in default_structure_list:
#         if not structure:
#             continue
#         structure_description += "\n - " + structure["name"] + ": " + structure["description"]
#         structure_list.append(structure["name"])
#     return structure_description, structure_list
#
